In [1]:
%matplotlib inline
%reload_ext autoreload
%autoreload 2

In [2]:
import pandas as pd
import numpy as np

In [24]:
movie_col = ['movie_id', 'titulo', 'genero']
movie = pd.read_csv('movies.dat', sep='::', names=movie_col)

/home/mich/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [21]:
movie.head()

   movie_id                              titulo                        genero
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [5]:
nombres = movie['titulo'].tolist()

In [ ]:
nombres[:10]

In [6]:
name_year = []
for i in nombres:
    if '(1' in i:
        name_year.append(i.split('(1'))
    elif '(20' in i:
        name_year.append(i.split('(20'))

In [7]:
year = []
for i in range(len(name_year)):
    if '9' in name_year[i][1]:
        year.append('1' + name_year[i][1])
    elif '00' in name_year[i][1]:
        year.append('20' + name_year[i][1])

In [ ]:
year[:10]

In [8]:
name = [i[0] for i in name_year]

In [ ]:
name[:60]

In [9]:
year = [i.split(')') for i in year]

In [10]:
year = [i[0] for i in year]

In [11]:
name = pd.DataFrame(name, columns=['titulo'])
years = pd.DataFrame(year, columns=['year'])

In [ ]:
years.head()

In [25]:
movie.drop(movie.columns[1], axis=1, inplace=True)

In [26]:
movie.head()

   movie_id                        genero
0         1   Animation|Children's|Comedy
1         2  Adventure|Children's|Fantasy
2         3                Comedy|Romance
3         4                  Comedy|Drama
4         5                        Comedy

In [31]:
#movies = pd.concat([years, movie])
movies = pd.merge(movie, name, left_on=None, right_on=None, left_index=True, right_index=True)
movies = pd.merge(movies, years, left_on=None, right_on=None, left_index=True, right_index=True)

In [32]:
movies.head()

   movie_id                        genero                        titulo  year
0         1   Animation|Children's|Comedy                    Toy Story   1995
1         2  Adventure|Children's|Fantasy                      Jumanji   1995
2         3                Comedy|Romance             Grumpier Old Men   1995
3         4                  Comedy|Drama            Waiting to Exhale   1995
4         5                        Comedy  Father of the Bride Part II   1995

In [34]:
cols = movies.columns.tolist()
cols

['movie_id', 'genero', 'titulo', 'year']

In [35]:
cols = ['movie_id', 'titulo', 'year', 'genero']
movies = movies[cols]

In [36]:
movies.head()

   movie_id                        titulo  year                        genero
0         1                    Toy Story   1995   Animation|Children's|Comedy
1         2                      Jumanji   1995  Adventure|Children's|Fantasy
2         3             Grumpier Old Men   1995                Comedy|Romance
3         4            Waiting to Exhale   1995                  Comedy|Drama
4         5  Father of the Bride Part II   1995                        Comedy

In [37]:
movies.tail()

      movie_id                titulo  year          genero
3878      3948     Meet the Parents   2000          Comedy
3879      3949  Requiem for a Dream   2000           Drama
3880      3950            Tigerland   2000           Drama
3881      3951     Two Family House   2000           Drama
3882      3952       Contender, The   2000  Drama|Thriller